//№1 Створіть скрипт, який буде запитувати у користувача довільний рядок та максимальну довжину рядку ( це має бути два prompt)
//Далі перевіряйте довжину рядка str і, якщо вона перевершує maxlength, замінює кінець str на "…", так, щоб її довжина дорівнювала maxlength.
//Результатом функції має бути той самий рядок, якщо усічення не потрібно, або, якщо необхідно, усічений рядок.

let str = prompt("Введіть довільний рядок:");
let maxLengthString = prompt("Введіть максимальну довжину рядку:");

if(str.length > maxLengthString){
    str = str.slice(0, maxLengthString - 1) + "…";
}
console.log(str);